import discord
import typing
from discord.ext import commands
from discord import app_commands
from market_functions import warframes_to_url, collect_titles_of_item, collect_data


class Market(commands.Cog):
    def __init__(self, bot) -> None:
        self.bot = bot

    #Ставит лайки всем постам
    # @commands.Cog.listener()
    # async def on_message(self, message: discord.Message):
    #     await message.add_reaction("\U0001F44D")


    #!hello -kORA
    @commands.command()
    async def hello(self, ctx, *, member: discord.Member):
        await ctx.send(f"Hello, {member.name}")

    #/hi
    @app_commands.command()
    async def hi(self, interaction: discord.Interaction):
        await interaction.response.send_message(f"Hello, {interaction.user.mention}")

    #/market {предмет}
    @app_commands.command(
        description="Посмотреть цену предмета"
    )
    async def market(self, 
                    interaction: discord.Interaction, 
                    item: str):
        author, min, quantity = collect_data(item)
        item_name, item_name_en = collect_titles_of_item(item)

        embed = discord.Embed(
            colour=discord.Colour.dark_teal(),
            description="\n",
            title=item_name
        )
        embed.add_field(name="Продавец", value=author, inline=False)
        embed.add_field(name="Цена", value=min)
        embed.add_field(name="Количество", value=quantity)
        embed.add_field(name="Написать продавцу", value=f"/w {author} Hi! I want to buy: {item_name_en} for {min} platinum. (HarrowBOT)", inline=False)

        await interaction.response.send_message(embed=embed)


    @market.autocomplete("item")
    async def market_autocompletion(
        self,
        interaction: discord.Interaction,
        current: str
    ) -> typing.List[app_commands.Choice[str]]:
        data = []
        for warframe_choice in [
            "Атлас Прайм Сет", "Атлас Прайм Каркас", "Атлас Прайм Система", "Атлас Прайм Нейрооптика", "Атлас Прайм Чертеж",
            "Банши Прайм Сет", "Банши Прайм Каркас", "Банши Прайм Система", "Банши Прайм Нейрооптика", "Банши Прайм Чертеж",
            "Валькирия Прайм Сет", "Валькирия Прайм Каркас", "Валькирия Прайм Система", "Валькирия Прайм Нейрооптика", "Валькирия Прайм Чертеж",
            "Вобан Прайм Сет", "Вобан Прайм Каркас", "Вобан Прайм Система", "Вобан Прайм Нейрооптика", "Вобан Прайм Чертеж",
            "Вольт Прайм Сет", "Вольт Прайм Каркас", "Вольт Прайм Система", "Вольт Прайм Нейрооптика", "Вольт Прайм Чертеж",
            "Вуконг Прайм Сет", "Вуконг Прайм Каркас", "Вуконг Прайм Система", "Вуконг Прайм Нейрооптика", "Вуконг Прайм Чертеж",
            "Гара Прайм Сет", "Гара Прайм Каркас", "Гара Прайм Система", "Гара Прайм Нейрооптика", "Гара Прайм Чертеж",
            "Гаруда Прайм Сет", "Гаруда Прайм Каркас", "Гаруда Прайм Система", "Гаруда Прайм Нейрооптика", "Гаруда Прайм Чертеж",
            "Гидроид Прайм Сет", "Гидроид Прайм Каркас", "Гидроид Прайм Система", "Гидроид Прайм Нейрооптика", "Гидроид Прайм Чертеж",
            "Зефир Прайм Сет", "Зефир Прайм Каркас", "Зефир Прайм Система", "Зефир Прайм Нейрооптика", "Зефир Прайм Чертеж",
            "Ивара Прайм Сет", "Ивара Прайм Каркас", "Ивара Прайм Система", "Ивара Прайм Нейрооптика", "Ивара Прайм Чертеж",
            "Инарос Прайм Сет", "Инарос Прайм Каркас", "Инарос Прайм Система", "Инарос Прайм Нейрооптика", "Инарос Прайм Чертеж",
            "Кора Прайм Сет", "Кора Прайм Каркас", "Кора Прайм Система", "Кора Прайм Нейрооптика", "Кора Прайм Чертеж",
            "Лимбо Прайм Сет", "Лимбо Прайм Каркас", "Лимбо Прайм Система", "Лимбо Прайм Нейрооптика", "Лимбо Прайм Чертеж",
            "Локи Прайм Сет", "Локи Прайм Каркас", "Локи Прайм Система", "Локи Прайм Нейрооптика", "Локи Прайм Чертеж",
            "Мираж Прайм Сет", "Мираж Прайм Каркас", "Мираж Прайм Система", "Мираж Прайм Нейрооптика", "Мираж Прайм Чертеж",
            "Миса Прайм Сет", "Миса Прайм Каркас", "Миса Прайм Система", "Миса Прайм Нейрооптика", "Миса Прайм Чертеж",
            "Мэг Прайм Сет", "Мэг Прайм Каркас", "Мэг Прайм Система", "Мэг Прайм Нейрооптика", "Мэг Прайм Чертеж",
            "Некрос Прайм Сет", "Некрос Прайм Каркас", "Некрос Прайм Система", "Некрос Прайм Нейрооптика", "Некрос Прайм Чертеж",
            "Нидус Прайм Сет", "Нидус Прайм Каркас", "Нидус Прайм Система", "Нидус Прайм Нейрооптика", "Нидус Прайм Чертеж",
            "Никс Прайм Сет", "Никс Прайм Каркас", "Никс Прайм Система", "Никс Прайм Нейрооптика", "Никс Прайм Чертеж",
            "Нова Прайм Сет", "Нова Прайм Каркас", "Нова Прайм Система", "Нова Прайм Нейрооптика", "Нова Прайм Чертеж",
            "Нэчжа Прайм Сет", "Нэчжа Прайм Каркас", "Нэчжа Прайм Система", "Нэчжа Прайм Нейрооптика", "Нэчжа Прайм Чертеж",
            "Оберон Прайм Сет", "Оберон Прайм Каркас", "Оберон Прайм Система", "Оберон Прайм Нейрооптика", "Оберон Прайм Чертеж",
            "Октавия Прайм Сет", "Октавия Прайм Каркас", "Октавия Прайм Система", "Октавия Прайм Нейрооптика", "Октавия Прайм Чертеж",
            "Ревенант Прайм Сет", "Ревенант Прайм Каркас", "Ревенант Прайм Система", "Ревенант Прайм Нейрооптика", "Ревенант Прайм Чертеж",
            "Рино Прайм Сет", "Рино Прайм Каркас", "Рино Прайм Система", "Рино Прайм Нейрооптика", "Рино Прайм Чертеж",
            "Сарина Прайм Сет", "Сарина Прайм Каркас", "Сарина Прайм Система", "Сарина Прайм Нейрооптика", "Сарина Прайм Чертеж",
            "Титания Прайм Сет", "Титания Прайм Каркас", "Титания Прайм Система", "Титания Прайм Нейрооптика", "Титания Прайм Чертеж",
            "Тринити Прайм Сет", "Тринити Прайм Каркас", "Тринити Прайм Система", "Тринити Прайм Нейрооптика", "Тринити Прайм Чертеж",
            "Фрост Прайм Сет", "Фрост Прайм Каркас", "Фрост Прайм Система", "Фрост Прайм Нейрооптика", "Фрост Прайм Чертеж",
            "Харроу Прайм Сет", "Харроу Прайм Каркас", "Харроу Прайм Система", "Харроу Прайм Нейрооптика", "Харроу Прайм Чертеж",
            "Хрома Прайм Сет", "Хрома Прайм Каркас", "Хрома Прайм Система", "Хрома Прайм Нейрооптика", "Хрома Прайм Чертеж",
            "Эквинокс Прайм Сет", "Эквинокс Прайм Каркас", "Эквинокс Прайм Система", "Эквинокс Прайм Нейрооптика", "Эквинокс Прайм Чертеж",
            "Эмбер Прайм Сет", "Эмбер Прайм Каркас", "Эмбер Прайм Система", "Эмбер Прайм Нейрооптика", "Эмбер Прайм Чертеж",
            "Эш Прайм Сет", "Эш Прайм Каркас", "Эш Прайм Система", "Эш Прайм Нейрооптика", "Эш Прайм Чертеж",
        ]:
            if current.lower() in warframe_choice.lower():
                data.append(app_commands.Choice(name=warframe_choice, value=warframe_choice))
        return data

    # @market.error
    # async def market_error(self, ctx, error):
    #     if isinstance(error, commands.CommandInvokeError):
    #         await ctx.send_message(f"{ctx.user.mention}, такой предмет не найден! Проверь правильность ввода :)")



async def setup(bot):
    await bot.add_cog(Market(bot))